In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("worldcup.csv")

In [3]:
display(data)

           Team  Rank  Year
0   West Indies     7  1975
1   West Indies     7  1979
2         India     2  1983
3     Australia     1  1987
4      Pakistan     6  1992
5     Sri Lanka     4  1996
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
9         India     2  2011
10    Australia     1  2015

In [14]:
# Calling the groups indies
print(data.groupby("Team").groups)

{'Australia': [3, 6, 7, 8, 10], 'India': [2, 9], 'Pakistan': [4], 'Sri Lanka': [5], 'West Indies': [0, 1]}

In [17]:
#count number of years 
print(data.groupby('Team')['Year'].max())

Team
Australia      2015
India          2011
Pakistan       1992
Sri Lanka      1996
West Indies    1979
Name: Year, dtype: int64

In [18]:
data.groupby('Team').groups

{'Australia': [3, 6, 7, 8, 10], 'India': [2, 9], 'Pakistan': [4], 'Sri Lanka': [5], 'West Indies': [0, 1]}

In [19]:
data.groupby('Team')['Year'].min()

Team
Australia      1987
India          1983
Pakistan       1992
Sri Lanka      1996
West Indies    1975
Name: Year, dtype: int64

In [28]:
data.groupby('Team').get_group('West Indies').value_counts()

Team         Rank  Year
West Indies  7     1975    1
                   1979    1
dtype: int64

In [30]:
data.groupby('Team').get_group('West Indies').sort_values(by='Team')

          Team  Rank  Year
0  West Indies     7  1975
1  West Indies     7  1979

In [27]:
data.sort_values(by="Team")

           Team  Rank  Year
3     Australia     1  1987
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
10    Australia     1  2015
2         India     2  1983
9         India     2  2011
4      Pakistan     6  1992
5     Sri Lanka     4  1996
0   West Indies     7  1975
1   West Indies     7  1979